/*œô¨¿œô¨Þœô¨Ôœô¨Úœô¨Ûœô¨îœô¨çœô¨Ðœô¨Õœô¨Ü œô¨áœô¨âœô¨Ðœô¨Ýœô¨Ôœô¨Ðœô¨àœô¨Ýœô¨âœô¨Ýœô¨ãœô¨î œô¨Ñœô¨Øœô¨Ñœô¨Ûœô¨Þœô¨âœô¨Õœô¨Úœô¨ã œô¨Òœô¨Òœô¨Þœô¨Ôœô¨Ð œô¨Ø œô¨Òœô¨ëœô¨Òœô¨Þœô¨Ôœô¨Ð*/
#include <stdio.h>
/*œô¨¿œô¨Þœô¨Ôœô¨Úœô¨Ûœô¨îœô¨çœô¨Ðœô¨Õœô¨Ü œô¨Ñœô¨Øœô¨Ñœô¨Ûœô¨Þœô¨âœô¨Õœô¨Úœô¨ã œô¨Ôœô¨Ûœô¨ï œô¨Øœô¨áœô¨ßœô¨Þœô¨Ûœô¨ìœô¨×œô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï œô¨ä-œô¨æœô¨Øœô¨Ø system("clear")(œô¨Ò windows system("cls")*/
#include <stdlib.h>
/*œô¨¿œô¨Þœô¨Ôœô¨Úœô¨Ûœô¨îœô¨çœô¨Ðœô¨Õœô¨Ü œô¨Üœô¨Ðœô¨âœô¨Õœô¨Üœô¨Ðœô¨âœô¨Øœô¨çœô¨Õœô¨áœô¨Úœô¨ãœô¨î œô¨Ñœô¨Øœô¨Ñœô¨Ûœô¨Þœô¨âœô¨Õœô¨Úœô¨ã œô¨Ôœô¨Ûœô¨ï œô¨Øœô¨áœô¨ßœô¨Þœô¨Ûœô¨ìœô¨×œô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï œô¨Üœô¨Ðœô¨âœô¨Õœô¨Üœô¨Ðœô¨âœô¨Øœô¨çœô¨Õœô¨áœô¨Úœô¨Øœô¨å œô¨ä-œô¨æœô¨Øœô¨Ù*/
#include <math.h>
/**œô¨ßœô¨Þœô¨Ôœô¨Úœô¨Ûœô¨îœô¨çœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨Ñœô¨Øœô¨Ñœô¨Ûœô¨Øœô¨Þœô¨âœô¨Õœô¨Ú**/

/*œô¨³œô¨Ûœô¨Ðœô¨Òœô¨Ýœô¨Ðœô¨ï œô¨ä-œô¨æœô¨Øœô¨ï main*/
int main()
{
  /*œô¨¾œô¨çœô¨Øœô¨âœô¨áœô¨Úœô¨Ð œô¨íœô¨Úœô¨àœô¨Ðœô¨Ýœô¨Ð œô¨ßœô¨Õœô¨àœô¨Õœô¨Ô œô¨Ýœô¨Ðœô¨çœô¨Ðœô¨Ûœô¨Þœô¨Ü œô¨àœô¨Ðœô¨Ñœô¨Þœô¨âœô¨ë*/
  system("cls");
  /*œô¨¾œô¨Ñœô¨êœô¨ïœô¨Òœô¨Ûœô¨ïœô¨Õœô¨Ü œô¨ßœô¨Õœô¨àœô¨Õœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨ëœô¨Õ: x-œô¨ßœô¨Õœô¨àœô¨Õœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨ï x, n-œô¨Ýœô¨Ðœô¨çœô¨Ðœô¨Ûœô¨ìœô¨Ýœô¨ëœô¨Ù œô¨Úœô¨Þœô¨íœô¨äœô¨äœô¨Øœô¨æœô¨Øœô¨Õœô¨Ýœô¨â n (œô¨Ôœô¨Ðœô¨Ýœô¨Ýœô¨ëœô¨Ù œô¨Ò œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨Ø),th-œô¨ßœô¨Õœô¨àœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨Ðœô¨ï œô¨Ò œô¨Úœô¨Ðœô¨âœô¨Þœô¨àœô¨ãœô¨Ñ œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨ëœô¨Òœô¨Ðœô¨Õœô¨âœô¨áœô¨ï œô¨âœô¨Þœô¨çœô¨Ýœô¨Þœô¨áœô¨âœô¨ì,zn1-œô¨ßœô¨Õœô¨àœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨Ðœô¨ï œô¨Ò œô¨Úœô¨Þœô¨âœô¨Þœô¨àœô¨ãœô¨î œô¨áœô¨Þœô¨åœô¨àœô¨Ðœô¨Ýœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨Ûœô¨Õœô¨Òœô¨Þœô¨Óœô¨Þ œô¨Òœô¨ëœô¨àœô¨Ðœô¨Öœô¨Õœô¨Ýœô¨Øœô¨ï */
  float x=0,n=5,th=0,zn1=0;
  /*œô¨ßœô¨àœô¨Þœô¨Ôœô¨Þœô¨Ûœô¨Öœô¨Ðœô¨Õœô¨Ü œô¨Þœô¨Ñœô¨êœô¨ïœô¨Ûœô¨Òœô¨ïœô¨âœô¨ì œô¨ßœô¨Õœô¨àœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨ëœô¨Õ: D-œô¨ßœô¨Õœô¨àœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨Ðœô¨ï œô¨Ôœô¨Ûœô¨ï œô¨áœô¨Þœô¨åœô¨àœô¨Ðœô¨Ýœô¨Õœô¨Ýœô¨Øœô¨ï œô¨ßœô¨àœô¨Þœô¨Üœô¨Õœô¨Öœô¨ãœô¨âœô¨Þœô¨çœô¨Ýœô¨Þœô¨Óœô¨Þ œô¨àœô¨Õœô¨×œô¨ãœô¨Ûœô¨ìœô¨âœô¨Ðœô¨âœô¨Ð œô¨áœô¨ãœô¨Üœô¨Üœô¨ë œô¨àœô¨ïœô¨Ôœô¨Ð*/
  float D=0;
  /*count-œô¨áœô¨çœô¨Õœô¨âœô¨çœô¨Øœô¨Ú œô¨Úœô¨Þœô¨Û-œô¨Òœô¨Ð œô¨Øœô¨âœô¨Õœô¨àœô¨Ðœô¨æœô¨Ø(œô¨áœô¨Ûœô¨Ðœô¨Óœô¨Ðœô¨Õœô¨Üœô¨ëœô¨å), Mx-œô¨ßœô¨Õœô¨àœô¨Õœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨Ðœô¨ï œô¨Øœô¨áœô¨ßœô¨Þœô¨Ûœô¨ìœô¨×œô¨ãœô¨Õœô¨Üœô¨Ðœô¨ï œô¨Ôœô¨Ûœô¨á œô¨Þœô¨×œô¨Ôœô¨Ðœô¨Ýœô¨Øœô¨ï œô¨æœô¨Øœô¨Úœô¨Ûœô¨Ð(œô¨¾œô¨Ýœô¨Ð œô¨ãœô¨Òœô¨Õœô¨Ûœô¨Øœô¨çœô¨Øœô¨Òœô¨Ðœô¨Õœô¨âœô¨áœô¨ï œô¨Úœô¨Ðœô¨Öœô¨Ôœô¨ëœô¨Ù œô¨æœô¨Øœô¨Úœô¨Û)  */
  int count=1,Mx=100;
  /*œô¨²œô¨ëœô¨Òœô¨Þœô¨Ôœô¨Øœô¨Ü œô¨áœô¨Þœô¨Þœô¨Ñœô¨éœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨Þ œô¨Òœô¨Òœô¨Þœô¨Ôœô¨Õ œô¨å*/
  printf("enter the X (-1<x<1)\n");
  /*œô¨áœô¨çœô¨Øœô¨âœô¨ëœô¨Òœô¨Ðœô¨Õœô¨Ü œô¨ßœô¨àœô¨Õœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨ãœô¨î œô¨å*/
  scanf("%f",&x);
  /*œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨Õ œô¨Úœô¨Þœô¨âœô¨Þœô¨àœô¨Þœô¨Õ œô¨Ýœô¨Õœô¨ßœô¨Þœô¨×œô¨Òœô¨Þœô¨Ûœô¨ïœô¨Õœô¨â œô¨Òœô¨Òœô¨Õœô¨áœô¨âœô¨Ø œô¨å œô¨Òœô¨Ýœô¨Õ œô¨Ôœô¨Þœô¨ßœô¨ãœô¨áœô¨âœô¨ëœô¨Üœô¨ëœô¨å œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨Ù œô¨â.œô¨Õ œô¨Õœô¨áœô¨Ûœô¨Ø œô¨å œô¨Ýœô¨Ðœô¨àœô¨ãœô¨èœô¨Øœô¨â œô¨íœô¨âœô¨Þ œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨Õ œô¨ßœô¨àœô¨Þœô¨Óœô¨àœô¨Üœô¨Üœô¨Ð œô¨ßœô¨àœô¨Þœô¨ßœô¨ãœô¨áœô¨âœô¨Øœô¨â œô¨íœô¨âœô¨Ðœô¨ß œô¨Òœô¨ëœô¨çœô¨Øœô¨áœô¨Ûœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨Ø œô¨×œô¨Ðœô¨Òœô¨Õœô¨àœô¨èœô¨Øœô¨â œô¨àœô¨Ðœô¨Ñœô¨Þœô¨âœô¨ã*/
  if(x<=-1 || x>=1){
    /*œô¨²œô¨ëœô¨Òœô¨Þœô¨Ô œô¨áœô¨Þœô¨Þœô¨Ñœô¨éœô¨Õœô¨Ýœô¨Øœô¨ï œô¨Þœô¨Ñ œô¨Þœô¨èœô¨Øœô¨Ñœô¨Úœô¨Õ*/
    printf("Error x cant be x>1 and x<-1 \n");
  }
  /*œô¨µœô¨áœô¨Ûœô¨Ø œô¨å œô¨Ò œô¨ßœô¨àœô¨Õœô¨Ôœô¨Õœô¨Ûœô¨Ðœô¨å œô¨Ôœô¨Þœô¨ß. œô¨×œô¨Ýœô¨Ðœô¨ç. œô¨âœô¨Þ œô¨Òœô¨ëœô¨ßœô¨Þœô¨Ûœô¨Ýœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨áœô¨Ûœô¨Õœô¨Ôœô¨ãœô¨îœô¨éœô¨Øœô¨Ù œô¨ãœô¨çœô¨Ðœô¨áœô¨âœô¨Þœô¨Ú œô¨ßœô¨àœô¨Þœô¨Óœô¨àœô¨Ðœô¨Üœô¨Üœô¨ë*/
  else{
    /*œô¨Áœô¨Þœô¨Þœô¨Ñœô¨éœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨Þ œô¨Òœô¨Òœô¨Þœô¨Ôœô¨Õ œô¨âœô¨Þœô¨çœô¨Ýœô¨Þœô¨áœô¨âœô¨Ø*/
    printf("Enter the accuracy \n");
    /*œô¨Áœô¨çœô¨Øœô¨âœô¨ëœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨Õ œô¨âœô¨Þœô¨çœô¨Ýœô¨Þœô¨áœô¨âœô¨Ø*/
    scanf("%f",&th);
    /*œô¨Àœô¨Ðœô¨áœô¨çœô¨Õœô¨â œô¨Ûœô¨Õœô¨Òœô¨Þœô¨Ù œô¨çœô¨Ðœô¨áœô¨âœô¨Ø œô¨Òœô¨ëœô¨àœô¨Ðœô¨Öœô¨Õœô¨Ýœô¨Øœô¨ï œô¨â.œô¨Õ œô¨ßœô¨àœô¨Õœô¨Òœô¨Þœô¨Óœô¨Þ œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨ï*/
    zn1=(0.25)*logf((1+x)/(1-x))+0.5*atanf(x);
    /*œô¨²œô¨ëœô¨Òœô¨Þœô¨Ô œô¨àœô¨Õœô¨×œô¨ãœô¨Ôœô¨ìœô¨ïœô¨âœô¨Ðœô¨âœô¨Þœô¨Ò œô¨àœô¨Ðœô¨áœô¨çœô¨Õœô¨âœô¨Ð œô¨Ýœô¨Ð œô¨íœô¨Úœô¨àœô¨Ðœô¨Ý*/
    printf("\nValue of right expr. | %f \n",zn1);
    /*œô¨½œô¨Ðœô¨çœô¨Ðœô¨Ûœô¨Þ œô¨æœô¨Øœô¨Úœô¨Ûœô¨Ð œô¨Òœô¨ëœô¨çœô¨Øœô¨Ûœô¨Õœô¨Ýœô¨Øœô¨ï. œô¨Þœô¨ßœô¨àœô¨Õœô¨Ôœô¨Ûœô¨ïœô¨Õœô¨Ü œô¨ßœô¨Õœô¨àœô¨Üœô¨Õœô¨Ýœô¨Ýœô¨ãœô¨î i œô¨Úœô¨Þœô¨âœô¨Þœô¨àœô¨Ðœô¨ï œô¨Ñœô¨ãœô¨Ôœô¨Õœô¨â œô¨ãœô¨Òœô¨Õœô¨Ûœô¨Øœô¨çœô¨Øœô¨Òœô¨Ðœô¨âœô¨áœô¨ï œô¨Úœô¨Ðœô¨Öœô¨Ôœô¨ëœô¨Ù œô¨àœô¨Ðœô¨× œô¨ßœô¨àœô¨Ø œô¨Òœô¨ëœô¨ßœô¨Þœô¨Ûœô¨Ýœô¨Õœô¨Ýœô¨Øœô¨Ø œô¨æœô¨Øœô¨Úœô¨Ûœô¨Ð */
    for(int i=0;i<Mx;i++)
	{
	  /*œô¨² œô¨Ýœô¨Ðœô¨çœô¨Ðœô¨Ûœô¨Õ œô¨Úœô¨Þœô¨Óœô¨Ôœô¨Ð i=0 œô¨ßœô¨àœô¨Øœô¨áœô¨Òœô¨Ðœô¨Õœô¨Òœô¨Ðœô¨Õœô¨Ü œô¨×œô¨Ðœô¨Ýœô¨çœô¨Õœô¨Ýœô¨Øœô¨î D œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨î x, œô¨âœô¨Þœô¨Óœô¨Þ œô¨âœô¨àœô¨Õœô¨Ñœô¨ãœô¨Õœô¨â œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨Õ œô¨â.œô¨Ú zn1=x+...+...*/
	  if(i<1)D=x;
	  /*œô¨Àœô¨Ðœô¨áœô¨çœô¨Øœô¨âœô¨ëœô¨Òœô¨Ðœô¨Õœô¨Ü œô¨áœô¨Ûœô¨Ðœô¨Óœô¨Ðœô¨Õœô¨Üœô¨Þœô¨Õ*/
	  D=D+(powf(x,n)/n);
	  /*œô¨Ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨Õ œô¨Òœô¨ëœô¨åœô¨Þœô¨Ôœô¨Ð œô¨Øœô¨× œô¨æœô¨Øœô¨Úœô¨Ûœô¨Ð œô¨ßœô¨àœô¨Ø œô¨Ôœô¨Þœô¨áœô¨âœô¨Øœô¨Öœô¨Õœô¨Ýœô¨Øœô¨Ø œô¨×œô¨Ðœô¨Ôœô¨Ðœô¨Ýœô¨Ýœô¨Þœô¨Ù œô¨âœô¨Þœô¨çœô¨Ýœô¨Þœô¨áœô¨âœô¨Ø*/
	  if(fabs(zn1-D)<th){break;}
	  /*œô¨ãœô¨Òœô¨Õœô¨Ûœô¨çœô¨Õœô¨Ýœô¨Øœô¨ï œô¨çœô¨Øœô¨áœô¨Ûœô¨Ð œô¨áœô¨Ûœô¨Ðœô¨Óœô¨Ðœô¨Õœô¨Üœô¨ëœô¨å*/
	  count++;
	  /*œô¨Ãœô¨Òœô¨Õœô¨Ûœô¨Øœô¨çœô¨Òœô¨Ðœô¨Õœô¨Ü œô¨Úœô¨Þœô¨íœô¨ä. n œô¨Ýœô¨Ð 4, œô¨â.œô¨Ú. œô¨Øœô¨áœô¨åœô¨Þœô¨Ôœô¨ï œô¨Øœô¨× œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨ï œô¨Úœô¨Ðœô¨Öœô¨Ôœô¨Þœô¨Õ œô¨Ýœô¨Þœô¨Òœô¨Þœô¨Õ œô¨áœô¨Ûœô¨Ðœô¨Óœô¨Ðœô¨Õœô¨Üœô¨Þœô¨Õ n œô¨ãœô¨Òœô¨Õœô¨Ûœô¨çœô¨Øœô¨Òœô¨Ðœô¨Õœô¨âœô¨áœô¨ï œô¨Ýœô¨Ð 4*/
	  n=n+4;
	  /*œô¨Ãœô¨Òœô¨Õœô¨Ûœô¨Øœô¨çœô¨Øœô¨Òœô¨Ðœô¨Õœô¨Ü œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨Õ Mx œô¨çœô¨âœô¨Þ œô¨Ñœô¨ë œô¨æœô¨Øœô¨Úœô¨Û œô¨ßœô¨àœô¨Þœô¨Ôœô¨Þœô¨Ûœô¨Öœô¨Øœô¨Û œô¨àœô¨Ðœô¨Ñœô¨Þœô¨âœô¨ã œô¨Ø œô¨×œô¨Ðœô¨Òœô¨Õœô¨àœô¨èœô¨Øœô¨Û œô¨Õœô¨ñ œô¨âœô¨Þœô¨Ûœô¨ìœô¨Úœô¨Þ œô¨ßœô¨àœô¨Ø œô¨Òœô¨ëœô¨ßœô¨Þœô¨Ûœô¨Ýœô¨Õœô¨Ýœô¨Øœô¨Ø œô¨ãœô¨áœô¨Ûœô¨Þœô¨Òœô¨Øœô¨ï œô¨Òœô¨ëœô¨åœô¨Þœô¨Ôœô¨Ð*/
	  Mx++;
	}
    /*œô¨²œô¨ëœô¨Òœô¨Þœô¨Ô œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Ø œô¨áœô¨Ûœô¨Õœô¨Òœô¨Ð*/
    printf("\n Value of left expr. | %f \n",D);
    /*œô¨²œô¨ëœô¨Òœô¨Þœô¨Ô œô¨Úœô¨Þœô¨Û-œô¨Òœô¨Ð œô¨áœô¨Ûœô¨Ðœô¨Óœô¨Ðœô¨Õœô¨Üœô¨ëœô¨å*/
	printf("\nNumber of terms = %d \n",count);
  }
	 
  /*œô¨²œô¨Þœô¨×œô¨Òœô¨àœô¨Ðœô¨â œô¨Ýœô¨ãœô¨Ûœô¨ï*/
  return 0;
}


